<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>Monitor24</string>
		<key>pfm_domain</key>
		<string>com.jigsaw24.Monitor24</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_interaction</key>
		<string>exclusive</string>
		<key>pfm_last_modified</key>
		<date>2024-01-01T10:35:00Z</date>
		<key>pfm_platforms</key>
		<array>
			<string>macOS</string>
		</array>
		<key>pfm_subkeys</key>
		<array>
			<dict>
				<key>pfm_default</key>
				<string>Monitor24 Configuration</string>
				<key>pfm_description</key>
				<string></string>
				<key>pfm_description_reference</key>
				<string></string>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>com.jigsaw24.Monitor24</string>
				<key>pfm_description</key>
				<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same &apos;PayloadIdentifier&apos; and &apos;PayloadUUID&apos; in the old and new profiles.</string>
				<key>pfm_description_reference</key>
				<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>com.jigsaw24.Monitor24</string>
				<key>pfm_description</key>
				<string>The payload type, which each payload domain&apos;s reference page specifies.</string>
				<key>pfm_description_reference</key>
				<string>The payload type.</string>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_description</key>
				<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use &apos;uuidgen&apos; to generate UUIDs. During a profile replacement, the system updates payloads with the same &apos;PayloadIdentifier&apos; and &apos;PayloadUUID&apos; in the old and new profiles.</string>
				<key>pfm_description_reference</key>
				<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_description</key>
				<string>The version of this specific payload.</string>
				<key>pfm_description_reference</key>
				<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>Monitor24 Endpoint Security Framework Logging</string>
				<key>pfm_description</key>
				<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
				<key>pfm_description_reference</key>
				<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PFC_SegmentedControl_0</string>
				<key>pfm_range_list_titles</key>
				<array>
					<string>General</string>
					<string>Event Types</string>
					<string>Filter Rules</string>
					<string>Authorisation Rules</string>
					<string>Upload to Sentinel</string>
					<string>Upload to Other</string>
				</array>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_segments</key>
				<dict>
					<key>Upload to Other</key>
					<array>
						<string>siemUploadURL</string>
						<string>siemUploadHeaders</string>
						<string>siemNewLineSeperated</string>
						<string>MaxDataUploadSize</string>

					</array>
					<key>Upload to Sentinel</key>
					<array>
						<string>SentinelUploadURL</string>
						<string>SentinelTennantId</string>
						<string>SentinelClientId</string>
						<string>SentinelClientSecret</string>
					</array>
					<key>General</key>
					<array>
						<string>DefaultFilterRules</string>
						<string>SelfProtectionRules</string>
						<string>RecordingEnabled</string>
						<string>DisableAll</string>
						<string>UploadOnHotspot</string>
						<string>EnableArchive</string>
						<string>MaxArchiveAge</string>
						<string>DisableController</string>
					</array>
					<key>Event Types</key>
					<array>
						<string>logAllEventTypes</string>
						<string>EventsToLog</string>
					</array>
					<key>Filter Rules</key>
					<array>
						<string>DoNotLogHomeDirectoryWrites</string>
						<string>filterRules</string>
					</array>
					<key>Authorisation Rules</key>
					<array>
						<string>FileOperationRules</string>
						<string>ExecuteProcessRules</string>
					</array>
				</dict>
				<key>pfm_type</key>
				<string>string</string>
			</dict>

			<dict>
				<key>pfm_description</key>
				<string>Events will be uploaded to the supplied url via HTTP POST. Note that events can be uploaded to the supplied URL or to sentinel not both.</string>
				<key>pfm_name</key>
				<string>siemUploadURL</string>
				<key>pfm_title</key>
				<string>Upload URL</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_present</key>
								<true/>
								<key>pfm_target</key>
								<string>SentinelUploadURL</string>
							</dict>
						</array>
					</dict>
				</array>
			</dict>

			<dict>
				<key>pfm_description</key>
				<string>Filter out file events made to files within the logged in user's home directory.</string>
				<key>pfm_name</key>
				<string>DoNotLogHomeDirectoryWrites</string>
				<key>pfm_title</key>
				<string>Filter Events within Home Directory</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>


			<dict>
				<key>pfm_description</key>
				<string>By default events are uploaded in JSON format as an array of events. Some systems require events to be seperated with a new line.</string>
				<key>pfm_name</key>
				<string>siemNewLineSeperated</string>
				<key>pfm_title</key>
				<string>Seperate Events with New Line</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>

			<dict>
				<key>pfm_name</key>
				<string>siemUploadHeaders</string>
				<key>pfm_title</key>
				<string>Request Headers</string>
				<key>pfm_description</key>
				<string>Headers to be included in the HTTP request.</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>headers</string>
						<key>pfm_title</key>
						<string>Request Headers</string>
						<key>pfm_description</key>
						<string>Headers to be included in the HTTP request.</string>
						<key>pfm_type</key>
						<string>dictionary</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>Header</string>
								<key>pfm_title</key>
								<string>Header</string>
								<key>pfm_type</key>
								<string>string</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>Value</string>
								<key>pfm_title</key>
								<string>Value</string>
								<key>pfm_type</key>
								<string>string</string>
							</dict>
						</array>
					</dict>
				</array>
			</dict>

			<dict>
				<key>pfm_description</key>
				<string>Tennant ID</string>
				<key>pfm_name</key>
				<string>SentinelTennantId</string>
				<key>pfm_title</key>
				<string>Sentinel Tennant ID</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>

			<dict>
				<key>pfm_description</key>
				<string>Client ID</string>
				<key>pfm_name</key>
				<string>SentinelClientId</string>
				<key>pfm_title</key>
				<string>Sentinel Client ID</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>

			<dict>
				<key>pfm_description</key>
				<string>Client Secret</string>
				<key>pfm_name</key>
				<string>SentinelClientSecret</string>
				<key>pfm_title</key>
				<string>Sentinel Client Secret</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>

			<dict>
				<key>pfm_description</key>
				<string>URL to upload events to Microsoft Sentinel</string>
				<key>pfm_name</key>
				<string>SentinelUploadURL</string>
				<key>pfm_title</key>
				<string>Sentinel Upload URL</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>


			<dict>
				<key>pfm_description</key>
				<string>Max size of single HTTP request uploading data. (Uncompressed size in bytes default size is 1,000,000 bytes)</string>
				<key>pfm_name</key>
				<string>MaxDataUploadSize</string>
				<key>pfm_title</key>
				<string>Max HTTP Request Size</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1000000</integer>
			</dict>

			<dict>
				<key>pfm_description</key>
				<string>Check to enable recording of events.</string>
				<key>pfm_name</key>
				<string>RecordingEnabled</string>
				<key>pfm_title</key>
				<string>Enable Recording</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>

			<dict>
				<key>pfm_name</key>
				<string>DefaultFilterRules</string>
				<key>pfm_title</key>
				<string>Add Default Filter Rules</string>
				<key>pfm_description</key>
				<string>Deploys default rules to discard some events which can be considered noise.</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>

			<dict>
				<key>pfm_name</key>
				<string>SelfProtectionRules</string>
				<key>pfm_title</key>
				<string>Add Self Protection Auth Rules</string>
				<key>pfm_description</key>
				<string>Deploys authorisation rules to attempt to stop the user making changes to Elevate24 Monitoring.</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>

			<dict>
				<key>pfm_description</key>
				<string>Disable all data collection/restrictions.</string>
				<key>pfm_name</key>
				<string>DisableAll</string>
				<key>pfm_title</key>
				<string>Disable All Data Collection/Restrictions</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>



			<dict>
				<key>pfm_name</key>
				<string>EnableArchive</string>
				<key>pfm_title</key>
				<string>Enable Local Retention of Events</string>
				<key>pfm_description</key>
				<string>Enables the local retention of Events after they have been uploaded.</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>

			<dict>
				<key>pfm_name</key>
				<string>MaxArchiveAge</string>
				<key>pfm_title</key>
				<string>Maximum Age of Retained Events (Days)</string>
				<key>pfm_description</key>
				<string>Sets maximum age of events retained locally.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>7</integer>
			</dict>

			<dict>
				<key>pfm_description</key>
				<string>Upload Events when connected to iPhone personal hotspot.</string>
				<key>pfm_name</key>
				<string>UploadOnHotspot</string>
				<key>pfm_title</key>
				<string>Allow Upload Data on Hotspot connection</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>

			<dict>
				<key>pfm_description</key>
				<string>Disables the use of the Monitor24 Controller App. This will disable the use of the controller app to start/stop event collection.</string>
				<key>pfm_name</key>
				<string>DisableController</string>
				<key>pfm_title</key>
				<string>Disable Monitor24 Controller</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>

			<dict>
				<key>pfm_name</key>
				<string>FileOperationRules</string>
				<key>pfm_title</key>
				<string>File Operation Rules</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_description</key>
				<string>Rules to restrict file operations. Allow rules can be used in conjunction with block rules to allow a process to execute under the specified conditions. \nFile open operations can be restricted to read only access where required.</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>FileOperationRules</string>
						<key>pfm_title</key>
						<string>File Operation Rules</string>
						<key>pfm_type</key>
						<string>dictionary</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>fileOperation</string>
								<key>pfm_title</key>
								<string>File Operation</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_range_list</key>
								<array>
									<string>file:open</string>
									<string>file:unlink</string>
								</array>
								<key>pfm_range_list_titles</key>
								<array>
									<string>File Open</string>
									<string>File Delete</string>
								</array>
							</dict>
							<dict>
								<key>pfm_default</key>
								<string>block</string>
								<key>pfm_name</key>
								<string>action</string>
								<key>pfm_title</key>
								<string>Action</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_range_list</key>
								<array>
									<string>allow</string>
									<string>block</string>
									<string>readOnly</string>
								</array>
								<key>pfm_range_list_titles</key>
								<array>
									<string>Allow</string>
									<string>Block</string>
									<string>Read Only (File Open Only)</string>
								</array>
							</dict>

							<dict>
								<key>pfm_name</key>
								<string>fileTargetPath</string>
								<key>pfm_title</key>
								<string>File Target Path</string>
								<key>pfm_type</key>
								<string>string</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>signingID</string>
								<key>pfm_title</key>
								<string>Signing ID of Process</string>
								<key>pfm_type</key>
								<string>string</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>username</string>
								<key>pfm_title</key>
								<string>Username</string>
								<key>pfm_type</key>
								<string>string</string>
							</dict>
						</array>
					</dict>
				</array>
			</dict>


			<dict>
				<key>pfm_default</key>
				<array>
					<dict/>
				</array>
				<key>pfm_description</key>
				<string>Rules to restrict execution of processes. Allow rules can be used in conjunction with block rules to allow a process to execute under the specified conditions. \nMultiple arguments can be specified by seperating them with a comma.</string>
				<key>pfm_name</key>
				<string>ExecuteProcessRules</string>
				<key>pfm_title</key>
				<string>Execute Process Rules</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>ExecuteProcessRules</string>
						<key>pfm_title</key>
						<string>Execute Process Rules</string>
						<key>pfm_type</key>
						<string>dictionary</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_default</key>
								<string>block</string>

								<key>pfm_name</key>
								<string>action</string>
								<key>pfm_title</key>
								<string>Action</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_range_list</key>
								<array>
									<string>allow</string>
									<string>block</string>
								</array>
								<key>pfm_range_list_titles</key>
								<array>
									<string>Allow</string>
									<string>Block</string>
								</array>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>processPath</string>
								<key>pfm_title</key>
								<string>Process Path</string>
								<key>pfm_type</key>
								<string>string</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>signingID</string>
								<key>pfm_title</key>
								<string>Signing Id of the Process</string>
								<key>pfm_type</key>
								<string>string</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>singingID</string>
								<key>pfm_title</key>
								<string>SigningID</string>
								<key>pfm_type</key>
								<string>string</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>teamID</string>
								<key>pfm_title</key>
								<string>Team ID</string>
								<key>pfm_type</key>
								<string>string</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>matchingArgumentsContaining</string>
								<key>pfm_title</key>
								<string>Match Arguments Containing</string>
								<key>pfm_type</key>
								<string>string</string>
							</dict>
						</array>
					</dict>
				</array>
			</dict>

			<dict>
				<key>pfm_description</key>
				<string>Set all event types to be logged.</string>
				<key>pfm_name</key>
				<string>logAllEventTypes</string>
				<key>pfm_title</key>
				<string>Log All Event Types</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>

			<dict>
				<key>pfm_conditionals</key>
				<array>
					<dict>
						<key>pfm_require</key>
						<string>always</string>
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<true/>
								</array>
								<key>pfm_target</key>
								<string>logAllEvents</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_present</key>
								<false/>
								<key>pfm_target</key>
								<string>logAllEvents</string>
							</dict>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false/>
								</array>
								<key>pfm_target</key>
								<string>logAllEvents</string>
							</dict>
						</array>
					</dict>
				</array>

				<key>pfm_default</key>
				<array>
					<dict/>
				</array>
				<key>pfm_description</key>
				<string>Define which event types to log.</string>
				<key>pfm_name</key>
				<string>EventsToLog</string>
				<key>pfm_title</key>
				<string>Event Types to Log</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_default</key>
				<array>
					<dict/>
				</array>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>EventType</string>
						<key>pfm_title</key>
						<string>Event Type</string>
						<key>pfm_type</key>
						<string>dictionary</string>


						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_default</key>
								<string>All</string>
								<key>pfm_name</key>
								<string>eventType</string>
								<key>pfm_title</key>
								<string>Event Type</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_range_list</key>
								<array>
									<string>File:Write</string>
									<string>File:Unlink</string>
									<string>File:Clone</string>
									<string>File:CopyFile</string>
									<string>File:Create</string>
									<string>File:Rename</string>

									<string>User:Create</string>
									<string>User:Delete</string>
									<string>Profile:Add</string>
									<string>Profile:Remove</string>
									<string>LaunchItem:Add</string>
									<string>LaunchItem:Remove</string>
									<string>Sudo</string>
									<string>Process:Exec</string>
								</array>
								<key>pfm_range_list_titles</key>
								<array>
									<string>File Write</string>
									<string>File Delete</string>
									<string>File Clone</string>
									<string>File Copy</string>
									<string>File Create</string>
									<string>File Rename</string>
									<string>User Create</string>
									<string>User Delete</string>
									<string>Profile Add</string>
									<string>Profile Remove</string>
									<string>Launch Item Add</string>
									<string>Launch Item Remove</string>
									<string>Sudo Command</string>
									<string>Execute Process</string>
								</array>
							</dict>
						</array>
					</dict>
				</array>
			</dict>

			<dict>
				<key>pfm_default</key>
				<array>
					<dict/>
				</array>
				<key>pfm_description</key>
				<string>Define rules to not store events matching the following rules.</string>
				<key>pfm_name</key>
				<string>filterRules</string>
				<key>pfm_title</key>
				<string>Filter Rules</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>filterRules</string>
						<key>pfm_title</key>
						<string>Filter Rules</string>
						<key>pfm_type</key>
						<string>dictionary</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>eventType</string>
								<key>pfm_title</key>
								<string>Event Type</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_range_list</key>
								<array>
									<string>All</string>
									<string>File:Write</string>
									<string>File:Unlink</string>
									<string>File:Clone</string>
									<string>File:CopyFile</string>
									<string>File:Create</string>
									<string>File:Rename</string>
									<string>User:Create</string>
									<string>User:Delete</string>
									<string>Profile:Add</string>
									<string>Profile:Remove</string>
									<string>LaunchItem:Add</string>
									<string>LaunchItem:Remove</string>
									<string>Sudo</string>
									<string>Process:Exec</string>
								</array>
								<key>pfm_range_list_titles</key>
								<array>
									<string>All</string>
									<string>File Write</string>
									<string>File Delete</string>
									<string>File Clone</string>
									<string>File Copy</string>
									<string>File Create</string>
									<string>File Rename</string>
									<string>User Create</string>
									<string>User Delete</string>
									<string>Profile Add</string>
									<string>Profile Remove</string>
									<string>Launch Item Add</string>
									<string>Launch Item Remove</string>
									<string>Sudo Command</string>
									<string>Execute Process</string>
								</array>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>path</string>
								<key>pfm_title</key>
								<string>File Path</string>
								<key>pfm_type</key>
								<string>string</string>

							</dict>
							<dict>
								<key>pfm_name</key>
								<string>signingId</string>
								<key>pfm_title</key>
								<string>Signing Id</string>
								<key>pfm_type</key>
								<string>string</string>

							</dict>
						</array>
					</dict>
				</array>
			</dict>
		</array>
		<key>pfm_targets</key>
		<array>
			<string>system</string>
			<string>user</string>
		</array>
		<key>pfm_title</key>
		<string>Monitor24 Endpoint Security Framework Logging</string>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_version</key>
		<integer>3</integer>
	</dict>
</plist>
